[
  {
    "id": 1,
    "title": "Garlic Butter Shrimp Pasta",
    "image": "garlic-butter-shrimp.jpg",
    "description": "A quick and luxurious pasta dish featuring juicy shrimp cooked in a rich garlic butter sauce, ready in just 20 minutes.",
    "ingredients": [
      "1 lb linguine pasta",
      "1 lb large shrimp, peeled and deveined",
      "4 tbsp butter",
      "6 cloves garlic, minced",
      "1/2 tsp red pepper flakes",
      "1/4 cup white wine",
      "2 tbsp lemon juice",
      "1/4 cup chopped parsley",
      "Salt and pepper to taste",
      "Parmesan cheese for serving"
    ],
    "steps": [
      "Cook pasta according to package directions. Reserve 1/2 cup pasta water before draining.",
      "While pasta cooks, melt 2 tbsp butter in a large skillet over medium-high heat.",
      "Add shrimp in a single layer and cook for 1-2 minutes per side until pink. Transfer to a plate.",
      "In the same skillet, add remaining butter and garlic. Cook for 30 seconds until fragrant.",
      "Add red pepper flakes and white wine, simmer for 2 minutes.",
      "Return shrimp to the skillet, add lemon juice, drained pasta, and enough pasta water to create a sauce.",
      "Toss everything together, add parsley, salt, and pepper.",
      "Serve immediately with grated Parmesan cheese."
    ]
  },
  {
    "id": 2,
    "title": "Grilled Salmon with Lemon-Dill Sauce",
    "image": "grilled-salmon.jpg",
    "description": "Perfectly grilled salmon fillets topped with a fresh lemon-dill sauce for a healthy and flavorful main dish.",
    "ingredients": [
      "4 salmon fillets (6 oz each)",
      "2 tbsp olive oil",
      "1 tsp salt",
      "1/2 tsp black pepper",
      "1/4 cup fresh lemon juice",
      "1/4 cup chopped fresh dill",
      "2 tbsp honey",
      "2 cloves garlic, minced",
      "1 tbsp Dijon mustard",
      "Lemon wedges for serving"
    ],
    "steps": [
      "Preheat grill to medium-high heat.",
      "Brush salmon with 1 tbsp olive oil and season with salt and pepper.",
      "In a small bowl, whisk together lemon juice, dill, honey, garlic, mustard, and remaining olive oil.",
      "Grill salmon skin-side down for 4-5 minutes, then flip and cook for another 3-4 minutes until it flakes easily.",
      "Transfer salmon to serving plates and drizzle with the lemon-dill sauce.",
      "Serve with lemon wedges on the side."
    ]
  },
  {
    "id": 3,
    "title": "New England Clam Chowder",
    "image": "clam-chowder.jpg",
    "description": "A creamy classic soup filled with clams, potatoes, and bacon for a comforting seafood dish.",
    "ingredients": [
      "4 slices bacon, diced",
      "1 large onion, diced",
      "2 celery stalks, diced",
      "3 tbsp all-purpose flour",
      "2 cups clam juice",
      "2 cups whole milk",
      "1 cup heavy cream",
      "3 medium potatoes, peeled and cubed",
      "2 cans (6.5 oz each) chopped clams, drained",
      "1 bay leaf",
      "1/2 tsp dried thyme",
      "Salt and pepper to taste",
      "Fresh parsley for garnish",
      "Oyster crackers for serving"
    ],
    "steps": [
      "In a large pot, cook bacon over medium heat until crispy. Remove bacon and set aside, leaving the fat in the pot.",
      "Add onion and celery to the pot, cook until softened, about 5 minutes.",
      "Sprinkle flour over vegetables and stir for 1 minute.",
      "Gradually whisk in clam juice, then add milk, cream, potatoes, bay leaf, and thyme.",
      "Bring to a simmer and cook until potatoes are tender, about 15 minutes.",
      "Add clams and cooked bacon, simmer for 5 more minutes.",
      "Remove bay leaf, season with salt and pepper.",
      "Garnish with parsley and serve with oyster crackers."
    ]
  },
  {
    "id": 4,
    "title": "Crispy Fish Tacos",
    "image": "fish-tacos.jpg",
    "description": "Baja-style tacos with crispy fish, tangy slaw, and spicy crema for a perfect lunch or dinner option.",
    "ingredients": [
      "1 lb firm white fish (cod, tilapia, or halibut)",
      "1 cup all-purpose flour",
      "1 tbsp cornstarch",
      "1 tsp baking powder",
      "1 tsp garlic powder",
      "1 tsp cumin",
      "1 tsp salt",
      "1 cup cold seltzer water",
      "Oil for frying",
      "8 small corn tortillas",
      "2 cups shredded cabbage",
      "1/4 cup chopped cilantro",
      "1 jalapeño, thinly sliced",
      "1 lime, cut into wedges",
      "1/2 cup sour cream",
      "1 tbsp hot sauce",
      "1 avocado, sliced"
    ],
    "steps": [
      "Cut fish into 16 equal pieces. Pat dry with paper towels.",
      "In a bowl, combine flour, cornstarch, baking powder, garlic powder, cumin, and salt.",
      "Whisk in seltzer water until a smooth batter forms.",
      "Heat oil to 375°F in a deep pot or fryer.",
      "Dip fish pieces in batter and fry in batches until golden brown, about 3-4 minutes. Drain on paper towels.",
      "Mix sour cream with hot sauce to make the crema.",
      "Warm tortillas on a dry skillet or in the microwave.",
      "Assemble tacos: tortilla, cabbage, fish, jalapeños, cilantro, crema, and avocado slices.",
      "Serve with lime wedges on the side."
    ]
  },
  {
    "id": 5,
    "title": "Lobster Risotto",
    "image": "lobster-risotto.jpg",
    "description": "A luxurious Italian rice dish featuring tender lobster meat, Parmesan cheese, and a touch of lemon for brightness.",
    "ingredients": [
      "2 lobster tails",
      "6 cups seafood stock",
      "2 tbsp olive oil",
      "1 tbsp butter",
      "1 shallot, finely diced",
      "2 cloves garlic, minced",
      "1 1/2 cups Arborio rice",
      "1/2 cup dry white wine",
      "1/2 cup grated Parmesan cheese",
      "2 tbsp chopped chives",
      "1 tbsp lemon zest",
      "Salt and pepper to taste"
    ],
    "steps": [
      "Bring a pot of water to boil. Add lobster tails and cook for 5 minutes until shells turn red.",
      "Remove meat from shells and chop into bite-sized pieces. Reserve shells.",
      "In a pot, combine seafood stock with lobster shells and simmer for 10 minutes. Strain and keep warm.",
      "In a large skillet, heat olive oil and butter. Add shallot and cook until translucent.",
      "Add garlic and rice, stir to coat grains for 2 minutes until slightly translucent.",
      "Pour in wine and stir until absorbed.",
      "Begin adding warm stock 1/2 cup at a time, stirring constantly and adding more stock as it's absorbed.",
      "After about 18 minutes, when rice is creamy and al dente, fold in lobster meat.",
      "Remove from heat, stir in Parmesan, chives, and lemon zest.",
      "Season with salt and pepper and serve immediately."
    ]
  },
  {
    "id": 6,
    "title": "Mediterranean Grilled Octopus",
    "image": "grilled-octopus.jpg",
    "description": "Tender octopus marinated in olive oil and herbs, then charred to perfection for a classic Mediterranean delicacy.",
    "ingredients": [
      "2 lbs fresh or frozen octopus, cleaned",
      "1 bay leaf",
      "3 cloves garlic, smashed",
      "1 lemon, halved",
      "1/4 cup olive oil, plus more for grilling",
      "2 tbsp red wine vinegar",
      "1 tbsp dried oregano",
      "1 tsp smoked paprika",
      "1/2 tsp red pepper flakes",
      "Salt and pepper to taste",
      "Fresh parsley for garnish",
      "Lemon wedges for serving"
    ],
    "steps": [
      "Place octopus in a large pot with bay leaf, garlic, and one lemon half. Cover with water.",
      "Bring to a simmer, then cook covered on low heat for 60-90 minutes until tender when pierced with a fork.",
      "Remove octopus and let cool. Cut into pieces, leaving tentacles whole if desired.",
      "Whisk together olive oil, vinegar, oregano, paprika, and red pepper flakes.",
      "Toss octopus in marinade and refrigerate for at least 30 minutes or up to 4 hours.",
      "Preheat grill to high heat. Oil the grates well.",
      "Grill octopus for 2-3 minutes per side until charred in spots.",
      "Arrange on a serving plate, sprinkle with salt, pepper, and chopped parsley.",
      "Serve with lemon wedges."
    ]
  },
  {
    "id": 7,
    "title": "Tuna Poke Bowl",
    "image": "tuna-poke.jpg",
    "description": "A refreshing Hawaiian-inspired bowl featuring fresh raw tuna, rice, avocado, and vegetables with a sesame-soy dressing.",
    "ingredients": [
      "1 lb sushi-grade tuna, cubed",
      "1/4 cup soy sauce",
      "2 tbsp sesame oil",
      "1 tbsp rice vinegar",
      "1 tsp honey",
      "1 tsp grated ginger",
      "2 cups cooked sushi rice",
      "1 avocado, sliced",
      "1 cucumber, thinly sliced",
      "1/2 cup edamame, shelled",
      "1/4 cup thinly sliced radishes",
      "2 green onions, chopped",
      "1 tbsp toasted sesame seeds",
      "Sriracha or wasabi for serving"
    ],
    "steps": [
      "In a bowl, whisk together soy sauce, sesame oil, rice vinegar, honey, and grated ginger.",
      "Add tuna cubes to the marinade and gently toss. Refrigerate for 15-30 minutes.",
      "Divide cooked rice between two bowls.",
      "Arrange marinated tuna, avocado slices, cucumber, edamame, and radishes over the rice.",
      "Drizzle any remaining marinade over the bowls.",
      "Garnish with green onions and sesame seeds.",
      "Serve with sriracha or wasabi on the side."
    ]
  },
  {
    "id": 8,
    "title": "Seafood Paella",
    "image": "seafood-paella.jpg",
    "description": "A classic Spanish rice dish loaded with various seafood, saffron, and vegetables, cooked to perfection in a wide pan.",
    "ingredients": [
      "1 1/2 cups Bomba or Arborio rice",
      "4 cups fish or seafood stock",
      "1 pinch saffron threads",
      "1/4 cup olive oil",
      "1 onion, diced",
      "1 red bell pepper, diced",
      "3 cloves garlic, minced",
      "1 tomato, diced",
      "1 tsp smoked paprika",
      "1/2 lb shrimp, peeled and deveined",
      "1/2 lb mussels, cleaned",
      "1/2 lb calamari rings",
      "1/2 cup frozen peas",
      "1 lemon, cut into wedges",
      "Fresh parsley for garnish",
      "Salt and pepper to taste"
    ],
    "steps": [
      "In a small bowl, steep saffron threads in 1/4 cup hot stock for 10 minutes.",
      "Heat olive oil in a large paella pan or wide skillet over medium heat.",
      "Sauté onion and bell pepper until softened, about 5 minutes.",
      "Add garlic and tomato, cook for 2 more minutes.",
      "Stir in paprika and rice, coating the grains with oil.",
      "Pour in saffron-infused stock and remaining stock. Bring to a simmer.",
      "Spread rice evenly in the pan and cook without stirring for 10 minutes.",
      "Arrange shrimp, mussels, and calamari on top of the rice.",
      "Sprinkle peas over everything and continue cooking until rice is tender and seafood is cooked, about 10 more minutes.",
      "Remove from heat, cover with a towel, and let rest for 5 minutes.",
      "Garnish with parsley and lemon wedges before serving."
    ]
  },
  {
    "id": 9,
    "title": "Crab Cakes with Remoulade",
    "image": "crab-cakes.jpg",
    "description": "Golden-brown crab cakes made with lump crab meat and minimal fillers, served with a tangy remoulade sauce.",
    "ingredients": [
      "1 lb lump crab meat, picked over for shells",
      "1/3 cup panko breadcrumbs",
      "1/4 cup mayonnaise",
      "1 egg, beaten",
      "2 tbsp Dijon mustard",
      "1 tbsp Worcestershire sauce",
      "1 tbsp fresh lemon juice",
      "1 tbsp chopped parsley",
      "1 tbsp Old Bay seasoning",
      "2 green onions, finely chopped",
      "Salt and pepper to taste",
      "2 tbsp butter for frying",
      "2 tbsp olive oil for frying",
      "For remoulade:",
      "1/2 cup mayonnaise",
      "1 tbsp capers, chopped",
      "1 tbsp sweet pickle relish",
      "1 tbsp fresh lemon juice",
      "1 tsp Dijon mustard",
      "1 tsp hot sauce",
      "1 clove garlic, minced"
    ],
    "steps": [
      "In a large bowl, gently mix crab meat, panko, mayonnaise, egg, mustard, Worcestershire sauce, lemon juice, parsley, Old Bay, and green onions.",
      "Season with salt and pepper. Cover and refrigerate for 30 minutes.",
      "Form mixture into 8 equal-sized patties, about 3/4 inch thick.",
      "Heat butter and oil in a large skillet over medium heat.",
      "Cook crab cakes in batches until golden brown, about 4 minutes per side.",
      "Meanwhile, make remoulade by combining all sauce ingredients in a small bowl.",
      "Drain crab cakes on paper towels.",
      "Serve warm with remoulade sauce on the side."
    ]
  },
  {
    "id": 10,
    "title": "Cioppino (Seafood Stew)",
    "image": "cioppino.jpg",
    "description": "A hearty Italian-American fish stew with a tomato and wine broth, loaded with a variety of seafood.",
    "ingredients": [
      "1/4 cup olive oil",
      "1 large onion, chopped",
      "4 cloves garlic, minced",
      "1 fennel bulb, thinly sliced",
      "1 tsp dried oregano",
      "1 tsp red pepper flakes",
      "1 bay leaf",
      "1 cup dry white wine",
      "1 can (28 oz) crushed tomatoes",
      "4 cups fish stock",
      "1 lb firm white fish (like cod or halibut), cut into chunks",
      "1 lb mussels, cleaned",
      "1/2 lb shrimp, peeled and deveined",
      "1/2 lb calamari, sliced into rings",
      "1/4 cup chopped fresh basil",
      "Salt and pepper to taste",
      "Crusty bread for serving"
    ],
    "steps": [
      "Heat olive oil in a large pot over medium heat.",
      "Add onion, garlic, and fennel. Cook until softened, about 5 minutes.",
      "Stir in oregano, red pepper flakes, and bay leaf.",
      "Add wine and simmer until reduced by half, about 5 minutes.",
      "Pour in crushed tomatoes and fish stock. Bring to a simmer.",
      "Cook for 15 minutes to allow flavors to blend.",
      "Add fish and simmer for 3 minutes.",
      "Add mussels, cover and cook for 2 minutes.",
      "Add shrimp and calamari, cover and cook for another 3 minutes until shrimp are pink and mussels are open.",
      "Discard any unopened mussels and the bay leaf.",
      "Stir in fresh basil and season with salt and pepper.",
      "Serve hot with crusty bread."
    ]
  },
  {
    "id": 11,
    "title": "Lemon Butter Scallops",
    "image": "lemon-scallops.jpg",
    "description": "Perfectly seared sea scallops in a simple lemon butter sauce, elegant yet quick enough for a weeknight dinner.",
    "ingredients": [
      "1 lb large sea scallops",
      "Salt and black pepper",
      "2 tbsp olive oil",
      "3 tbsp butter, divided",
      "4 cloves garlic, minced",
      "2 tbsp fresh lemon juice",
      "1/4 cup dry white wine",
      "2 tbsp chopped fresh parsley",
      "Lemon wedges for serving"
    ],
    "steps": [
      "Pat scallops dry with paper towels. Season both sides with salt and pepper.",
      "Heat olive oil and 1 tbsp butter in a large skillet over high heat until very hot.",
      "Add scallops in a single layer, being careful not to crowd the pan. Cook for 2-3 minutes without moving.",
      "Flip scallops and cook for 1-2 minutes more until golden and just cooked through. Remove to a plate.",
      "Reduce heat to medium and add remaining butter and garlic to the pan. Cook for 30 seconds.",
      "Add wine and lemon juice, scraping up any browned bits from the bottom of the pan.",
      "Simmer sauce for 2 minutes until slightly reduced.",
      "Return scallops to the pan to warm through, about 30 seconds.",
      "Sprinkle with parsley and serve immediately with lemon wedges."
    ]
  },
  {
    "id": 12,
    "title": "Shrimp and Grits",
    "image": "shrimp-grits.jpg",
    "description": "A Southern classic featuring creamy cheese grits topped with spicy shrimp and bacon for a comforting meal any time of day.",
    "ingredients": [
      "1 cup stone-ground grits",
      "4 cups chicken broth",
      "2 tbsp butter",
      "1 cup shredded sharp cheddar cheese",
      "1 lb large shrimp, peeled and deveined",
      "6 slices bacon, chopped",
      "1 bell pepper, diced",
      "1 small onion, diced",
      "2 cloves garlic, minced",
      "1 tbsp Cajun seasoning",
      "1/4 cup green onions, chopped",
      "Hot sauce to taste",
      "Salt and pepper to taste"
    ],
    "steps": [
      "In a saucepan, bring chicken broth to a boil. Slowly whisk in grits.",
      "Reduce heat to low, cover, and simmer for 20-25 minutes, stirring occasionally.",
      "Remove from heat, stir in butter and cheese. Cover and keep warm.",
      "In a large skillet, cook bacon until crispy. Remove bacon but leave drippings.",
      "Season shrimp with Cajun seasoning, salt, and pepper.",
      "Sauté shrimp in bacon drippings for 2-3 minutes until pink. Remove and set aside.",
      "In the same skillet, sauté bell pepper and onion until softened.",
      "Add garlic and cook for 30 seconds more.",
      "Return bacon and shrimp to the skillet, toss to combine.",
      "Spoon grits into bowls, top with shrimp mixture and green onions.",
      "Serve with hot sauce on the side."
    ]
  },
  {
    "id": 13,
    "title": "Miso-Glazed Cod",
    "image": "miso-cod.jpg",
    "description": "A Japanese-inspired fish dish with a sweet and savory miso glaze, perfectly caramelized under the broiler.",
    "ingredients": [
      "4 cod fillets (6 oz each)",
      "1/4 cup white miso paste",
      "3 tbsp mirin",
      "2 tbsp sake or dry white wine",
      "2 tbsp brown sugar",
      "1 tbsp soy sauce",
      "1 tbsp grated ginger",
      "2 green onions, thinly sliced",
      "1 tbsp toasted sesame seeds",
      "Steamed rice for serving"
    ],
    "steps": [
      "In a small bowl, whisk together miso paste, mirin, sake, brown sugar, soy sauce, and ginger.",
      "Place cod fillets in a shallow dish and pour marinade over them.",
      "Cover and refrigerate for at least 30 minutes, up to 12 hours.",
      "Preheat broiler. Line a baking sheet with foil and lightly oil.",
      "Remove cod from marinade, reserving the marinade.",
      "Place cod on prepared baking sheet and broil for 6-8 minutes until fish flakes easily.",
      "Meanwhile, transfer reserved marinade to a small saucepan and bring to a simmer for 2 minutes.",
      "Drizzle reduced marinade over broiled cod.",
      "Garnish with green onions and sesame seeds.",
      "Serve with steamed rice."
    ]
  },
  {
    "id": 14,
    "title": "Thai Coconut Curry Mussels",
    "image": "curry-mussels.jpg",
    "description": "Fresh mussels steamed in a spicy Thai coconut curry broth for an impressive yet simple seafood dish.",
    "ingredients": [
      "2 lbs mussels, scrubbed and debearded",
      "1 tbsp coconut oil",
      "1 shallot, thinly sliced",
      "2 cloves garlic, minced",
      "1 tbsp grated ginger",
      "2 tbsp Thai red curry paste",
      "1 can (14 oz) coconut milk",
      "1/2 cup chicken or seafood broth",
      "1 tbsp fish sauce",
      "1 tbsp brown sugar",
      "1 lime, juiced",
      "1/4 cup chopped cilantro",
      "2 green onions, sliced",
      "Thai basil leaves for garnish",
      "Crusty bread for serving"
    ],
    "steps": [
      "Inspect mussels and discard any that are open and don't close when tapped.",
      "Heat coconut oil in a large pot over medium heat.",
      "Add shallot, garlic, and ginger. Cook until fragrant, about 2 minutes.",
      "Stir in curry paste and cook for 1 minute more.",
      "Add coconut milk, broth, fish sauce, and brown sugar. Bring to a simmer.",
      "Add mussels to the pot and cover. Cook for 5-7 minutes until mussels open.",
      "Discard any mussels that haven't opened after cooking.",
      "Stir in lime juice and cilantro.",
      "Ladle mussels and broth into bowls.",
      "Garnish with green onions and Thai basil.",
      "Serve with crusty bread for dipping into the broth."
    ]
  },
  {
    "id": 15,
    "title": "Ceviche",
    "image": "ceviche.jpg",
    "description": "A refreshing Latin American dish of raw fish marinated in citrus juices and mixed with fresh vegetables and herbs.",
    "ingredients": [
      "1 lb fresh firm white fish (sea bass, halibut, or snapper), diced",
      "1 cup fresh lime juice (8-10 limes)",
      "1/2 red onion, finely diced",
      "1 jalapeño, seeded and minced",
      "1 cup cherry tomatoes, quartered",
      "1 cucumber, peeled, seeded, and diced",
      "1 avocado, diced",
      "1/2 cup chopped cilantro",
      "1 tbsp olive oil",
      "Salt and pepper to taste",
      "Tortilla chips for serving"
    ],
    "steps": [
      "Place fish in a glass bowl and cover with lime juice. The fish should be completely submerged.",
      "Cover and refrigerate for 2-3 hours until fish is opaque and firm.",
      "Drain off most of the lime juice, leaving about 2 tablespoons.",
      "Add red onion, jalapeño, tomatoes, cucumber, avocado, and cilantro to the fish.",
      "Drizzle with olive oil and gently toss to combine.",
      "Season with salt and pepper to taste.",
      "Cover and refrigerate for an additional 30 minutes to allow flavors to meld.",
      "Serve chilled with tortilla chips."
    ]
  },
  {
    "id": 16,
    "title": "Fish en Papillote",
    "image": "fish-papillote.jpg",
    "description": "A healthy method of cooking fish in parchment paper packets with vegetables and herbs, creating a flavorful steam bath.",
    "ingredients": [
      "4 white fish fillets (6 oz each), such as tilapia or cod",
      "2 zucchini, thinly sliced",
      "1 carrot, julienned",
      "1 leek, white part only, thinly sliced",
      "1 lemon, thinly sliced",
      "4 sprigs fresh thyme",
      "4 tbsp butter",
      "4 tbsp dry white wine",
      "Salt and pepper to taste",
      "4 large pieces of parchment paper"
    ],
    "steps": [
      "Preheat oven to 400°F (200°C).",
      "Cut parchment paper into large hearts. Fold in half and open up.",
      "Divide vegetables among the parchment hearts, placing them on one side of the fold.",
      "Season fish fillets with salt and pepper and place on top of vegetables.",
      "Top each fillet with a sprig of thyme, a slice of lemon, and 1 tbsp butter.",
      "Drizzle 1 tbsp wine over each fillet.",
      "Fold parchment over and seal edges by making small overlapping folds.",
      "Place packets on a baking sheet and bake for 12-15 minutes.",
      "Transfer packets to plates and let diners open them at the table to release the aromatic steam."
    ]
  },
  {
    "id": 17,
    "title": "Seared Ahi Tuna",
    "image": "ahi-tuna.jpg",
    "description": "Quickly seared ahi tuna steaks with a sesame crust, rare in the center and served with a zesty ponzu dipping sauce.",
    "ingredients": [
      "4 ahi tuna steaks (6 oz each), about 1-inch thick",
      "2 tbsp olive oil",
      "1/4 cup soy sauce",
      "1 tbsp rice vinegar",
      "1 tbsp honey",
      "1 tsp wasabi paste",
      "1/3 cup white sesame seeds",
      "1/3 cup black sesame seeds",
      "Salt and pepper to taste",
      "For ponzu sauce:",
      "1/4 cup soy sauce",
      "2 tbsp fresh orange juice",
      "2 tbsp fresh lime juice",
      "1 tsp mirin",
      "1/2 tsp grated ginger",
      "1 green onion, thinly sliced"
    ],
    "steps": [
      "In a shallow dish, whisk together soy sauce, rice vinegar, honey, and wasabi paste.",
      "Add tuna steaks and marinate for 15 minutes, flipping once.",
      "Meanwhile, make ponzu sauce by combining all sauce ingredients in a small bowl.",
      "On a plate, mix together white and black sesame seeds with salt and pepper.",
      "Remove tuna from marinade and pat dry.",
      "Press tuna into sesame seed mixture, coating all sides.",
      "Heat olive oil in a large skillet over high heat until very hot.",
      "Sear tuna for 30-45 seconds per side for rare, or 1-2 minutes per side for medium-rare.",
      "Remove from heat and let rest for 1 minute.",
      "Slice tuna against the grain into 1/4-inch thick pieces.",
      "Serve with ponzu dipping sauce."
    ]
  }
]